app/Controllers/Artikel.php

SELECT *
FROM `artikel`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $q = $this->request->getVar('q') ?? '';
    $model = new ArtikelModel();
    $data = [
      'title' => $title,
      'q' => $q,
      'artikel' => $model->paginate(2), #data dibatasi 2 record perhalaman