app/Controllers/Artikel.php

  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $q = $this->request->getVar('q') ?? '';
    $model = new ArtikelModel();
    $data = [
      'title' => $title,
      'q' => $q,
      'artikel' => $model->like('judul', $q)->paginate(10), #data dibatasi 10 record perhalaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10